//
//  000_230816.swift
//  CodingTest
//
//  Created by watching-dev on 2023/08/16.
//  공부 방법
//
/*
 
    공부를 제대로 해본 적이 없어서 그런가 도저히 어떻게 풀어야 할지 답이 안 나온다
    LV.0 이라고, 입문이라고, 아무리 쉬운 문제라고 해도 도저히 어떤 식으로 풀어야 할지 모르겠다
    1시간을 고민해도 답은 절대 안 나올듯하다

    그래서 예전에 코딩 테스트 맛보기 할 때 했던 방법인데,
    다른 사람들이 풀어 놓은 것을 찾아서 참고하고 그 풀이를 공부하는 방법으로 시작하기로.

    구글에 swift 프로그래머스 문제라고 검색해서 풀이를 먼저 찾았는데 역시나 있었다
    그래서 풀이를 참고해서 왜 이렇게 풀었는지 공부하는 형식으로 진행해 보겠음
 
        - - - - - - - - - - - - - - - - - - - - - - -
 
    이번에 도움을 받을 글은 이번 역은 서현역님의 글이다, 이 글을 빌려 감사의 인사를 전합니다 :)
    https://zoeful-log.tistory.com/132
    https://github.com/seohyeon2/algorithm-study-in-swift/blob/seohyeon2/Seohyeon2/Seohyeon2/PGS/LEVEL_0/PGS_120583.swift
    
 */
